app/views/users/show.html.erb

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
---
    <dl class="dl-horizontal">
      <% if @user.profile.fullname and !@user.profile.fullname.empty? %>