app/controllers/problems_controller.rb

SELECT `problems`.* FROM `problems` WHERE `problems`.`id` = 1 LIMIT 1
---
  def show
    @problem = Problem.find(params[:id])

SELECT `problems`.* FROM `problems` WHERE `problems`.`id` = 1 LIMIT 1
---
  def edit
    @problem = Problem.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `ratings` SET `problems_posted` = 1, `updated_at` = '2012-09-09 18:42:09' WHERE `ratings`.`id` = 1
INSERT INTO `problems` (`created_at`, `description`, `posted_date`, `solved_times`, `title`, `updated_at`, `user_id`) VALUES ('2012-09-09 18:42:09', '', '2012-09-01', 0, '', '2012-09-09 18:42:09', 1)
INSERT INTO `log_items` (`at`, `content`, `created_at`, `problem_id`, `updated_at`, `user_id`) VALUES ('2012-09-09 18:42:09', 'posted', '2012-09-09 18:42:09', 1, '2012-09-09 18:42:09', 1)
SELECT `log_items`.* FROM `log_items` ORDER BY at DESC LIMIT 5
---
  def create
    @problem = Problem.new(params[:problem])
    @problem.user_id = current_user.id
    @user = User.find(current_user.id)
    @user.increment_rating_posted

    respond_to do |format|
      if @problem.save
        @log_item = LogItem.create(:user_id => current_user.id, :content => "posted", :problem_id => @problem.id, :at => DateTime.now)
        @log_items = LogItem.all :order => "at DESC", :limit => LogItem.limit

SELECT `problems`.* FROM `problems` WHERE `problems`.`id` = 1 LIMIT 1
---
  def update
    @problem = Problem.find(params[:id])

SELECT `problems`.* FROM `problems` WHERE `problems`.`id` = 1 LIMIT 1
DELETE FROM `problems` WHERE `problems`.`id` = 1
---
  def destroy
    @problem = Problem.find(params[:id])
    @problem.destroy