app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
SELECT `problems`.* FROM `problems` WHERE `problems`.`user_id` = 1 ORDER BY posted_date DESC LIMIT 5
SELECT `solved_problems`.* FROM `solved_problems` WHERE `solved_problems`.`user_id` = 1 ORDER BY solved_at DESC LIMIT 5
---
  def show
    @user = User.find(params[:id])
    @problems_posted = Problem.find_all_by_user_id @user.id, :order => "posted_date DESC", :limit => 5
    @problems_solved = @user.solved_problems.find :all, :order => "solved_at DESC", :limit => 5